// ===== ch5_3.ino =====
const int speed=48;      //宣告播放速度
const int buzzerPin=13;   //宣告buzzerPin信號連接13腳
//宣告基本音符
const int Note[]={ 494, 523,587,659,698,784,880,988, 1046,1175,1318};
//宣告望春風音階陣列
const int song[]={ 2,2,3,5,  6,5,6,7,  9,7,7,6,5,  6,
                7,9,9,7,9,  5,6,6,  2,7,7,6,5,  5,
                6,6,7,6,5,  3,2,3,5,  3,5,6,7,  9,
                9,9,10,9,7, 7,6,5,3,  2,7,7,6,5,  5, 100}; //100為結束符號
//宣告望春風節拍陣列
const int beat[]={   12,4,8,8, 8,4,4,16, 12,4,4,4,8, 32,                    
              12,4,8,4,4, 12,4,16,  12,4,8,4,4, 32,
              12,4,8,4,4, 8,4,4,16, 12,4,8,8, 32,
                12,4,8,4,4, 8,4,4,16, 12,4,8,4,4, 32};

//==================================
void setup() {
  pinMode(buzzerPin, OUTPUT); //將buzzerPin腳規畫為輸出埠
  digitalWrite(buzzerPin, 0);   //buzzerPin初值設定為0
}
//==================================
void loop() {
  int x=0;              //宣告取音指標變數
  while(song[x]!=100){     //若非結束符號，則執行迴圈
    int duration = speed*beat[x];      //計算節拍
    tone(buzzerPin,Note[song[x]],duration);  //播音
    delay(duration*1.3);      //暫停
    x++;                //下一個音
  }
  noTone(buzzerPin);         //靜音
  delay(10000);            //暫停5秒
}

